#!/usr/bin/python3
"""

"""
from desc_dicts.descraptions import Qid_Desc
# ---
tiny_wrwr = {
    "Q1260524": {"ar": "وقت من اليوم", "en": ""},  # 68707
    "Q76130167": {"ar": "مبنى بحثي", "en": ""},  # 27575
    "Q6881511": {"ar": "مقاولة", "en": ""},  # 20179
    "Q891723": {"ar": "شركة عمومية محدودة", "en": ""},  # 7625
    "Q20747295": {"ar": "جين يشفر بروتين", "en": ""},  # 4818
    "Q15261477": {"ar": "انتخابات محلية", "en": ""},  # 4796
    "Q721747": {"ar": "لافتة تاريخية", "en": ""},  # 4213
    "Q263478": {"ar": "درجة موسيقية", "en": ""},  # 3945
    "Q674925": {"ar": "خلية جذعية مستحثة", "en": ""},  # 3382
    "Q3241045": {"ar": "تفشي مرض", "en": ""},  # 3226
    "Q4164871": {"ar": "منصب", "en": ""},  # 2965
    "Q230752": {"ar": "أوديتوريوم", "en": ""},  # 2713
    "Q204107": {"ar": "مجموعات وعناقيد المجرات", "en": ""},  # 2579
    "Q93184": {"ar": "رسم", "en": ""},  # 2565
    "Q272447": {"ar": "سحابة جزيئية", "en": ""},  # 2367
    "Q11282": {"ar": "منطقة هيدروجين II", "en": ""},  # 2112
    "Q125191": {"ar": "صورة", "en": ""},  # 2072
    "Q210272": {"ar": "التراث الثقافي", "en": ""},  # 1963
    "Q5003624": {"ar": "نصب تذكاري", "en": ""},  # 1861
    "Q15416": {"ar": "برنامج تلفزيون", "en": ""},  # 1856
    "Q221722": {"ar": "مرافق منفصلة للدراجات", "en": ""},  # 1833
    "Q575759": {"ar": "نصب الحرب", "en": ""},  # 1780
    "Q215380": {"ar": "طاقم موسيقي", "en": ""},  # 1754
    "Q618779": {"ar": "جائزة", "en": ""},  # 1746
    "Q726": {"ar": "حصان", "en": ""},  # 1690
    "Q497654": {"ar": "أجسام نجمية فتية", "en": ""},  # 1612
    "Q47461344": {"ar": "عمل مكتوب", "en": ""},  # 1483
    "Q694045": {"ar": "تشريع مفوض", "en": ""},  # 1475
    "Q637866": {"ar": "عرض الكتب", "en": ""},  # 1473
    "Q386724": {"ar": "عمل", "en": ""},  # 1376
    "Q5398426": {"ar": "مسلسل تلفزيوني", "en": ""},  # 1334
    "Q1148359": {"ar": "أدب رمادي", "en": ""},  # 1267
    "Q1363750": {"ar": "كرسي", "en": ""},  # 1228
    "Q744691": {"ar": "نجوم الأعجوبة", "en": ""},  # 1214
    "Q429785": {"ar": "ملصق", "en": ""},  # 1164
    "Q1151284": {"ar": "المجرة العنقودية الالمع", "en": ""},  # 1149
    "Q39911916": {"ar": "إعلان", "en": ""},  # 1134
    "Q49084": {"ar": "قصة قصيرة", "en": ""},  # 1132
    "Q87167": {"ar": "مخطوط", "en": ""},  # 1100
    "Q5707594": {"ar": "مقالة إخبارية", "en": ""},  # 1036
    "Q273057": {"ar": "ديسكوغرافيا", "en": ""},  # 1023
    "Q1491746": {"ar": "تجمع مجري", "en": ""},  # 973
    "Q11276": {"ar": "عنقود مغلق", "en": ""},  # 956
    "Q5871": {"ar": "قزم أبيض", "en": ""},  # 916
    "Q464980": {"ar": "معرض", "en": ""},  # 910
    "Q35127": {"ar": "موقع ويب", "en": ""},  # 909
    "Q4504495": {"ar": "حفل توزيع جوائز", "en": ""},  # 893
    "Q2557101": {"ar": "منطقة خط أنبعاثات نووي منخفض التأين", "en": ""},  # 879
    "Q483453": {"ar": "نافورة", "en": ""},  # 871
    "Q207628": {"ar": "تأليف موسيقي", "en": ""},  # 870
    "Q506240": {"ar": "فيلم تلفزيوني", "en": ""},  # 850
    "Q22247": {"ar": "انفجار أشعة غاما", "en": ""},  # 848
    "Q3937": {"ar": "مستعر أعظم", "en": ""},  # 839
    "Q191067": {"ar": "مقالة", "en": ""},  # 826
    "Q188593": {"ar": "متغير قيفاوي", "en": ""},  # 823
    "Q18593264": {"ar": "عنصر مجموعة أو معرض", "en": ""},  # 801
    "Q20006438": {"ar": "زمالة", "en": ""},  # 798
    "Q28640": {"ar": "مهنة", "en": ""},  # 780
    "Q732577": {"ar": "منشور", "en": ""},  # 762
    "Q175331": {"ar": "تظاهر", "en": ""},  # 731
    "Q13406554": {"ar": "منافسة رياضية", "en": ""},  # 717
    "Q11032": {"ar": "صحيفة", "en": ""},  # 710
    "Q188509": {"ar": "ضاحية", "en": ""},  # 709
    "Q783794": {"ar": "شركة", "en": ""},  # 708
    "Q1142192": {"ar": "نجم متميز كيميائيا", "en": ""},  # 691
    "Q1269627": {"ar": "تعديل (قانون)", "en": ""},  # 689
    "Q1054444": {"ar": "سحب بين النجوم", "en": ""},  # 683
    "Q41298": {"ar": "مجلة", "en": ""},  # 646
    "Q46135307": {"ar": "بلد في منافسة رياضية", "en": ""},  # 641
    "Q217012": {"ar": "مجرة راديوية", "en": ""},  # 639
    "Q1002697": {"ar": "دورية", "en": ""},  # 635
    "Q80793": {"ar": "مزولة", "en": ""},  # 633
    "Q1266946": {"ar": "أطروحة", "en": ""},  # 600
    "Q208569": {"ar": "ألبوم إستديو", "en": ""},  # 597
    "Q341": {"ar": "برمجيات حرة", "en": ""},  # 569
    "Q42948": {"ar": "جدار", "en": ""},  # 567
    "Q381885": {"ar": "قبر", "en": ""},  # 557
    "Q34379": {"ar": "آلة موسيقية", "en": ""},  # 555
    "Q101600": {"ar": "قزم بني", "en": ""},  # 550
    "Q277759": {"ar": "سلسلة كتب", "en": ""},  # 545
    "Q737498": {"ar": "دورية أكاديمية", "en": ""},  # 524
    "Q16510064": {"ar": "حدث رياضي", "en": ""},  # 516
    "Q180846": {"ar": "سوبرماركت", "en": ""},  # 511
    "Q8362": {"ar": "منمنمة", "en": ""},  # 506
}
# ---
for ps in tiny_wrwr:
    if ps in Qid_Desc:
        print(ps)
# ---
