#!/usr/bin/python
# -*- coding: utf-8 -*-
"""


"""
#
# (C) Ibrahem Qasim, 2022
#
#

#falselabels = [list[x]["ar"] for x in list]
falselabels = ["قناة بحرية", "ساحل", "قصر", "كنيسة", "نتوء جبلي", "مستجمع مائي", "غابة", "جبل"
, "أخدود غائص", "غطاء جليدي", "مقراب راديوي", "منطقة عازلة", "مصحة", "كلية", "مياه ضحلة"
, "هرم", "جون", "واد", "مضيق", "كازينو", "مخروط بركاني", "وادي", "سد مائي", "مطار مروحيات"
, "زراعة مائية", "طاحونة مائية", "مرج", "سد", "منطقة رطبة", "رعية", "مستوطنة", "سهل"
, "محطة طاقة", "موقف حافلات", "فرع", "قمة جبل", "مائدة صحراوية", "خليج", "موقف سيارات"
, "كرم", "سخان", "أخدود", "سلسلة جبلية", "", "جبل بحري", "محيط", "بركان", "خور"
, "أراضي أشجار قمئية", "مزار", "رأس", "ميناء", "خزان مائي", "أكمة أوراسية", "مثلجة"
, "تندرا", "قناة", "جامعة", "مطار", "محمية طبيعية", "إسطبل", "محطة قطار", "ينبوع"
, "منطقة رملية", "بئر نفط", "مبنى", "قاعدة عسكرية", "نفق", "قارة", "جزيرة متصلة"
, "شارع", "قاعدة بحرية", "نقطة", "جرف", "كالديرا", "بركة سمك", "براح", "بَنْك", "متحف"
, "هور", "بحيرة", "إفجيج", "محطة رصد جوي", "قناة ري", "جدول مائي", "ملاحات", "هضبة"
, "شاطئ", "جيوت", "منارة", "خلل", "منطقة شعاب", "منطقة", "قلعة", "مرصد", "جرف", "كهف"
, "قرية", "ملعب غولف", "بوغاز", "حقل نفط", "متنزه", "قناة", "منجم", "جزيرة", "مرفأ"
, "منطقة صناعية", "حوض بناء سفن", "منحدر قاري", "آلة صراف آلي", "منخفض", "بركة"
, "شلال", "نوناتاك", "ضفة", "حاجز مائي", "منطقة تاريخية", "مستنقع", "مجرى مائي"
, "جزيرة صغيرة", "بحيرة شاطئة", "فاصل", "تل"]
#replacement3["ar"] = ['بحر', 'براح', 'سبخة', 'مستوطنة', 'منطقة رطبة', 'مستنقع', 'سلسلة جبلية', 'تل', 'قمة جبل', 'سهل', 'جرف', 'منخفض', 'متنزه', 'بحيرة شاطئة', 'منطقة رملية', 'نهر', 'نقطة', '', 'حقل نفط', 'جزيرة', 'جبل', 'سد', 'نتوء جبلي', 'هضبة', 'محمية طبيعية', 'بحيرة', 'سد مائي', 'أخدود', 'جزيرة صغيرة', 'مطار', 'مضيق', 'شعاب', 'ميناء', 'قناة ري', 'قرية', 'فرع', 'خزان مائي', 'كثيب', 'منجم']

#---