#!/usr/bin/python
# -*- coding: utf-8 -*-
"""

إضافة التقسيم الإداري بناءاً على تصانيف ويكيبيديا العربية

"""
#
# (C) Ibrahem Qasim, 2022
#
#

import json
import re
import time

import pywikibot
#---
import gent
# generator = gent.get_gent(*args)
# gent.gent_string2html( title , arsite.encoding() )
#---
#import Nationalities as aa
import codecs
from datetime import datetime
#---
import sys
#---
import urllib
import urllib
import urllib.request
import urllib.parse

site = pywikibot.Site('wikidata', 'wikidata')
repo = site.data_repository()
#---
# start of himoAPI.py file
from API import himoAPI
#himoAPI.Claim_API2( item_numeric , property, id)
#himoAPI.Claim_API_With_Quall(q , pro ,numeric, quall_prop , quall_id)
#himoAPI.New_API(data2, summary)
#himoAPI.New_Mult_Des( q, data2, summary , ret )
#himoAPI.Des_API( Qid, desc , lang )
#himoAPI.Labels_API( Qid, desc , lang , False)
#---
# start of himoBOT.py file
from API import himoBOT
#---
def getwditem(title):
    ara = pywikibot.Site("ar", "wikipedia") 
    item = ''
    EngPage = pywikibot.Page(ara, title)
    try:
        item = pywikibot.ItemPage.fromPage(EngPage)
        item.get()
        #pywikibot.output( '**<<lightyellow>> GetItem "%s":' %  title )
        return item
    except:
        #pywikibot.output('*error when item.get() "%s"' % title)
        return False
#---
def Find_Add_Claims(item , property, id , id2):   
    q = item.title(as_link=False)
    #---
    claims = item.claims
    if property in claims:
        pywikibot.output('find ' + property)
    else:
        #AddClaims(q, property, id )
        id = re.sub( 'Q' , '' , id )
        himoAPI.Claim_API2(q , property , id)
        if id2:
            id2 = re.sub( 'Q' , '' , id2 )
            himoAPI.Claim_API2(q , property , id2)
            
#---
def main(*args):
    options = {}
    #---
    #lenth = len(pywikibot.handle_args(args))
    #if lenth == 0:
    #args = {'-ref:قالب:تصنيف_وفيات_في' , '-ns:14'}
    #
    #args = {'-ref:قالب:تصنيف_مواليد_في' , '-ns:14'}
    #---
    for category in categories.keys():
        CategoryID = categories[category]['id']
        args = {'-catr:' + category , '-ns:0'}
        #args = {'-catr:' + category , '-ns:0' , '-onlyifnot:P131=' + CategoryID}
        pywikibot.output(args)
        #---
        generator = gent.get_gent(*args)
        
        #generator = list_template_usage()
        num = 0
        #---
        for page in generator:
            num = num + 1
            #text = page.text
            MainTitle = page.title(as_link=False)
            #start(text, title)
            #try:   #start(text, title)
            pywikibot.output( '<<lightyellow>>\n----------\n>> %d >> %s << <<' % ( num , MainTitle) )
            item = getwditem(MainTitle)
            #---
            if item:
                Find_Add_Claims(item , 'P131' , CategoryID )
#---
arwiki = pywikibot.Site("ar", "wikipedia")

categories = {
            'قرى_مديرية_سباح'  : {'id': 'Q4117509'},
            'قرى عزلة الأفيوش'  : {'id': 'Q12180047'},
            'قرى عزلة ال شبوان'  : {'id': 'Q12225081'},
            'قرى_عزلة_اراك'  : {'id': 'Q12225038'},
            'قرى_عزلة_ارياب'  : {'id': 'Q12225039'},
            'قرى_عزلة_افصر'  : {'id': 'Q12225050'},
            'قرى_عزلة_ال_الثابثي'  : {'id': 'Q12225053'},
            'قرى_عزلة_ال_الثرياء'  : {'id': 'Q12225054'},
            'قرى_عزلة_ال_السادة'  : {'id': 'Q12225056'},
            'قرى_عزلة_ال_اللبني'  : {'id': 'Q12225058'},
            'قرى_عزلة_ال_اليحوي'  : {'id': 'Q12225062'},
            'قرى_عزلة_ال_بقش'  : {'id': 'Q12225063'},
            'قرى_عزلة_ال_بلغيث_ولمذود'  : {'id': 'Q12225065'},
            'قرى_عزلة_ال_جلال'  : {'id': 'Q12225069'},
            'قرى_عزلة_ال_جميل'  : {'id': 'Q12225068'},
            'قرى_عزلة_ال_حذقين'  : {'id': 'Q12225070'},
            'قرى_عزلة_ال_حسن'  : {'id': 'Q12225071'},
            'قرى_عزلة_ال_راشد_منيف'  : {'id': 'Q12225076'},
            'قرى_عزلة_ال_سعيد'  : {'id': 'Q12225078'},
            'قرى_عزلة_ال_عامر'  : {'id': 'Q12225083'},
            'قرى_عزلة_ال_عامر_حوران'  : {'id': 'Q12225085'},
            'قرى_عزلة_ال_عبيد'  : {'id': 'Q12225087'},
            'قرى_عزلة_ال_عقيل'  : {'id': 'Q12225089'},
            'قرى_عزلة_ال_غانم'  : {'id': 'Q12225092'},
            'قرى_عزلة_ال_غشام_الملاجم'  : {'id': 'Q12225094'},
            'قرى_عزلة_ال_فجيح'  : {'id': 'Q12225093'},
            'قرى_عزلة_ال_فرج'  : {'id': 'Q12225095'},
            'قرى_عزلة_ال_قزعة'  : {'id': 'Q12225096'},
            'قرى_عزلة_ال_مشعل'  : {'id': 'Q12225100'},
            'قرى_عزلة_بني_سري'  : {'id': 'Q12226220'},
            'قرى_عزلة_بني_سرحة'  : {'id': 'Q12226217'},
            'قرى_عزلة_بني_سباء'  : {'id': 'Q12226214'},
            'قرى_عزلة_بني_ساوي'  : {'id': 'Q12226212'},
            'قرى_عزلة_بني_زيد'  : {'id': 'Q12226209'},
            'قرى_عزلة_بني_زهير'  : {'id': 'Q12226207'},
            'قرى_عزلة_بني_رزق'  : {'id': 'Q12226202'},
            'قرى_عزلة_بني_داوود'  : {'id': 'Q12226197'},
            'قرى_عزلة_بني_حيدان'  : {'id': 'Q12226189'},
            'قرى_عزلة_بني_حمادي'  : {'id': 'Q12226184'},
            'قرى_عزلة_بني_حفيظ_والمكارمة'  : {'id': 'Q12226181'},
            'قرى_عزلة_بني_حسن_(حجة)'  : {'id': 'Q12226176'},
            'قرى_عزلة_بني_حربي'  : {'id': 'Q12226173'},
            'قرى_عزلة_بني_جل'  : {'id': 'Q12226164'},
            'قرى_عزلة_بني_جديلة'  : {'id': 'Q12226159'},
            'قرى_عزلة_بني_ثواب'  : {'id': 'Q12226153'},
            'قرى_عزلة_بني_أبو_هادي_والعباد'  : {'id': 'Q12226059'},
            'قرى_عزلة_بني_الوليد'  : {'id': 'Q12226145'},
            'قرى_عزلة_بني_المصعب'  : {'id': 'Q12226134'},
            'قرى_عزلة_بني_القدمي'  : {'id': 'Q12226129'},
            'قرى_عزلة_بني_الفخر'  : {'id': 'Q12226126'},
            'قرى_عزلة_بني_الغذيفي'  : {'id': 'Q12226123'},
            'قرى_عزلة_بني_العوام'  : {'id': 'Q12226122'},
            'قرى_عزلة_بني_العثمانيين'  : {'id': 'Q12226117'},
            'قرى_عزلة_بني_العاتي'  : {'id': 'Q12226114'},
            'قرى_عزلة_بني_الضبيبي'  : {'id': 'Q12226112'},
            'قرى_عزلة_بني_الضاحتين'  : {'id': 'Q12226111'},
            'قرى_عزلة_بني_الشومي'  : {'id': 'Q12226108'},
            'قرى_عزلة_بني_الذواد'  : {'id': 'Q12226100'},
            'قرى_عزلة_بني_الخياط'  : {'id': 'Q12226098'},
            'قرى_عزلة_بني_الحداد'  : {'id': 'Q12226092'},
            'قرى_عزلة_بني_الحجاج'  : {'id': 'Q12226091'},
            'قرى_عزلة_بني_الحارث_(حجة)'  : {'id': 'Q12226087'},
            'قرى_عزلة_بني_الحارث'  : {'id': 'Q12226086'},
            'قرى_عزلة_الجزر'  : {'id': 'Q12225295'},
            'قرى_عزلة_الجريدا'  : {'id': 'Q12225294'},
            'قرى_عزلة_الجرو'  : {'id': 'Q12225290'},
            'قرى_عزلة_الجرشة'  : {'id': 'Q12225287'},
            'قرى_عزلة_الجدير'  : {'id': 'Q12225278'},
            'قرى_عزلة_الجديدة'  : {'id': 'Q12225277'},
            'قرى_عزلة_الجبوب'  : {'id': 'Q12225267'},
            'قرى_عزلة_الجبلين'  : {'id': 'Q12225264'},
            'قرى_عزلة_الجبر_الشرقي'  : {'id': 'Q12225259'},
            'قرى_عزلة_الجبر_الاعلى'  : {'id': 'Q12225260'},
            'قرى_عزلة_الجبر_الاسفل'  : {'id': 'Q12225258'},
            'قرى_عزلة_الجبر'  : {'id': 'Q12225257'},
            'قرى_عزلة_الثوابي'  : {'id': 'Q12225254'},
            'قرى_عزلة_الثلث_(حجة)'  : {'id': 'Q12225250'},
            'قرى_عزلة_التويتي'  : {'id': 'Q12225249'},
            'قرى_عزلة_التفادي'  : {'id': 'Q12225247'},
            'قرى_عزلة_التربة'  : {'id': 'Q12225243'},
            'قرى_عزلة_البيادح'  : {'id': 'Q12225229'},
            'قرى_عزلة_البشاري'  : {'id': 'Q12225221'},
            'قرى_عزلة_البديع'  : {'id': 'Q12225214'},
            'قرى_عزلة_البحريين'  : {'id': 'Q12225212'},
            'قرى_عزلة_البجالية'  : {'id': 'Q12225210'},
            'قرى_عزلة_البتارية'  : {'id': 'Q12225206'},
            'قرى_عزلة_الأهجر'  : {'id': 'Q12225121'},
            'قرى_عزلة_الأحجول'  : {'id': 'Q12225120'},
            'قرى_عزلة_الانبوة'  : {'id': 'Q12225196'},
            'قرى_عزلة_الامرور'  : {'id': 'Q12225195'},
            'قرى_عزلة_الاكاحلة'  : {'id': 'Q12225190'},
            'قرى_عزلة_الاغوال_العلياء'  : {'id': 'Q12225185'},
            'قرى_عزلة_الاغوال_السفلى'  : {'id': 'Q12225186'},
            'قرى_عزلة_الاشراف'  : {'id': 'Q12225163'},
            'قرى_عزلة_الاشاهبة'  : {'id': 'Q12225158'},
            'قرى_عزلة_الادبعة'  : {'id': 'Q12225148'},
            'قرى_عزلة_ال_هياش'  : {'id': 'Q12225114'},
            'قرى_عزلة_ال_هصيص'  : {'id': 'Q12225113'},
            'قرى_عزلة_ال_هادي_بني_وهب'  : {'id': 'Q12225111'},
            'قرى_عزلة_ال_منصور_بني_وهب'  : {'id': 'Q12225112'},
            'قرى_عزلة_ال_منصور_الملاجم'  : {'id': 'Q12225110'},
            'قرى_عزلة_ال_منصور'  : {'id': 'Q12225109'},
            'قرى_عزلة_ال_مقبل'  : {'id': 'Q12225106'},
            'قرى_عزلة_ال_مظفرالصدارة'  : {'id': 'Q12225104'},
            'قرى_عزلة_ال_مظفرالاعلى'  : {'id': 'Q12225103'},
            'قرى_عزلة_ال_مظفرالاسفل'  : {'id': 'Q12225102'},
            'قرى_عزلة_بني_سعيد'  : {'id': 'Q12226225'},
            'قرى_عزلة_بني_سكران'  : {'id': 'Q12226226'},
            'قرى_عزلة_بني_سليمان'  : {'id': 'Q12226232'},
            'قرى_عزلة_بني_سيف_السافل'  : {'id': 'Q12226238'},
            'قرى_عزلة_بني_سيف_العالي'  : {'id': 'Q12226240'},
            'قرى_عزلة_بني_شاكر'  : {'id': 'Q12226239'},
            'قرى_عزلة_بني_شبيب'  : {'id': 'Q12226241'},
            'قرى_عزلة_بني_شداد'  : {'id': 'Q4855715'},
            'قرى_عزلة_بني_عاطف'  : {'id': 'Q12226262'},
            'قرى_عزلة_بني_عبد_العزيز'  : {'id': 'Q12226266'},
            'قرى_عزلة_بني_عبد_الكريم'  : {'id': 'Q12226268'},
            'قرى_عزلة_بني_عبد_الله'  : {'id': 'Q12226267'},
            'قرى_عزلة_بني_عضابي'  : {'id': 'Q12226276'},
            'قرى_عزلة_بني_عكاب'  : {'id': 'Q12226279'},
            'قرى_عزلة_بني_علي'  : {'id': 'Q12226285'},
            'قرى_عزلة_بني_علي_(حجة)'  : {'id': 'Q12226284'},
            'قرى_عزلة_بني_عمارة'  : {'id': 'Q20387651'},
            'قرى_عزلة_بني_عمر'  : {'id': 'Q12226288'},
            'قرى_عزلة_بني_عمر_العالي'  : {'id': 'Q12226291'},
            'قرى_عزلة_بني_عواض'  : {'id': 'Q12226295'},
            'قرى_عزلة_بني_عوض'  : {'id': 'Q12226297'},
            'قرى_عزلة_بني_غشيم'  : {'id': 'Q12226314'},
            'قرى_عزلة_بني_غيلان'  : {'id': 'Q12226318'},
            'قرى_عزلة_بني_فايد'  : {'id': 'Q12226320'},
            'قرى_عزلة_بني_قشب'  : {'id': 'Q12226325'},
            'قرى_عزلة_بني_مأمون'  : {'id': 'Q12226337'},
            'قرى_عزلة_بني_مبارز'  : {'id': 'Q12226339'},
            'قرى_عزلة_بني_مجيع'  : {'id': 'Q12226340'},
            'قرى_عزلة_بني_محرم'  : {'id': 'Q12226341'},
            'قرى_عزلة_بني_مدسم'  : {'id': 'Q12226349'},
            'قرى_عزلة_بني_مرغم'  : {'id': 'Q12226352'},
            'قرى_عزلة_بني_مسلم'  : {'id': 'Q12226357'},
            'قرى_عزلة_بني_معوض'  : {'id': 'Q12226361'},
            'قرى_عزلة_بني_معين'  : {'id': 'Q12226363'},
            'قرى_عزلة_بني_مليك'  : {'id': 'Q12226370'},
            'قرى_عزلة_بني_منبة'  : {'id': 'Q16121053'},
            'قرى_عزلة_بني_منصور'  : {'id': 'Q12226374'},
            'قرى_عزلة_بني_مهدى'  : {'id': 'Q12226377'},
            'قرى_عزلة_بني_ميدي'  : {'id': 'Q12226385'},
            'قرى_عزلة_بني_نشر'  : {'id': 'Q12226388'},
            'قرى_عزلة_بني_هات'  : {'id': 'Q12226391'},
            'قرى_عزلة_بني_هني'  : {'id': 'Q12226395'},
            'قرى_عزلة_بني_يعفر'  : {'id': 'Q12226402'},
            'قرى_عزلة_بني_يعمر'  : {'id': 'Q12226404'},
            'قرى_عزلة_بني_يوس'  : {'id': 'Q12226405'},
            'قرى_عزلة_بيت_الشماع'  : {'id': 'Q12226419'},
            'قرى_عزلة_بيت_الصائدي'  : {'id': 'Q12226421'},
            'قرى_عزلة_بيت_قدم'  : {'id': 'Q12226429'},
            'قرى_عزلة_بيحان_الدولة'  : {'id': 'Q12226430'},
            'قرى_عزلة_تريم'  : {'id': 'Q12226433'},
            'قرى_عزلة_ثمن_الرياشية'  : {'id': 'Q12226441'},
            'قرى_عزلة_ثواب_اعلى'  : {'id': 'Q12226443'},
            'قرى_عزلة_ثواب_الأسفل'  : {'id': 'Q12226444'},
            'قرى_عزلة_جاذب'  : {'id': 'Q12226448'},
            'قرى_عزلة_جانب_الشام'  : {'id': 'Q12226450'},
            'قرى_عزلة_جانب_اليمن'  : {'id': 'Q12226449'},
            'قرى_عزلة_جبع'  : {'id': 'Q12226451'},
            'قرى_عزلة_جبل_الجبالي'  : {'id': 'Q12226454'},
            'قرى_عزلة_جبل_الرياشية'  : {'id': 'Q12226456'},
            'قرى_عزلة_جبل_السحل'  : {'id': 'Q12226457'},
            'قرى_عزلة_جبل_الشغادرة'  : {'id': 'Q12226458'},
            'قرى_عزلة_يهر'  : {'id': 'Q25932234'},
            'قرى_عزلة_وادى_غامس'  : {'id': 'Q16121125'},
            'قرى_عزلة_مذوقين'  : {'id': 'Q16121114'},
            'قرى_عزلة_يعرة'  : {'id': 'Q12227102'},
            'قرى_عزلة_يريس'  : {'id': 'Q12227098'},
            'قرى_عزلة_يحير'  : {'id': 'Q12227097'},
            'قرى_عزلة_يامن'  : {'id': 'Q12227095'},
            'قرى_عزلة_وكية'  : {'id': 'Q12227087'},
            'قرى_عزلة_وعله_آل_رقاب'  : {'id': 'Q12227085'},
            'قرى_عزلة_وضرة'  : {'id': 'Q12227082'},
            'قرى_عزلة_وراف'  : {'id': 'Q12227081'},
            'قرى_عزلة_وحلان'  : {'id': 'Q12227080'},
            'قرى_عزلة_وادي_عصام'  : {'id': 'Q12227072'},
            'قرى_عزلة_وادي_سير'  : {'id': 'Q12227070'},
            'قرى_عزلة_وادي_ضباء'  : {'id': 'Q12227069'},
            'قرى_عزلة_وادي_حجاج'  : {'id': 'Q12227064'},
            'قرى_عزلة_وادي_المعقاب'  : {'id': 'Q12227059'},
            'قرى_عزلة_وادي_العين'  : {'id': 'Q12227058'},
            'قرى_عزلة_وادي_الرياشية'  : {'id': 'Q12227057'},
            'قرى_عزلة_وادي_الحبالي'  : {'id': 'Q12227055'},
            'قرى_عزلة_هربة'  : {'id': 'Q12227036'},
            'قرى_عزلة_هدفان'  : {'id': 'Q12227034'},
            'قرى_عزلة_نيسا'  : {'id': 'Q12227030'},
            'قرى_عزلة_نوسان'  : {'id': 'Q12227027'},
            'قرى_عزلة_نقيل_العقاب'  : {'id': 'Q12227024'},
            'قرى_عزلة_نخلان'  : {'id': 'Q12227017'},
            'قرى_عزلة_نجا'  : {'id': 'Q12227015'},
            'قرى_عزلة_ميتم'  : {'id': 'Q12227010'},
            'قرى_عزلة_مقنع_الأعلى'  : {'id': 'Q12227000'},
            'قرى_عزلة_مقنع'  : {'id': 'Q12226999'},
            'قرى_عزلة_معبق'  : {'id': 'Q12226994'},
            'قرى_عزلة_مطولة'  : {'id': 'Q12226990'},
            'قرى_عزلة_مسويا'  : {'id': 'Q12226987'},
            'قرى_عزلة_مسورة'  : {'id': 'Q12226986'},
            'قرى_عزلة_مسور_ال_دباش'  : {'id': 'Q12226984'},
            'قرى_عزلة_مسروح'  : {'id': 'Q12226982'},
            'قرى_عزلة_مساهر_مور'  : {'id': 'Q12226980'},
            'قرى_عزلة_مذيخرة'  : {'id': 'Q12226970'},
            'قرى_عزلة_مدوم'  : {'id': 'Q12226968'},
            'قرى_عزلة_مديخة'  : {'id': 'Q12226967'},
            'قرى_عزلة_مبين'  : {'id': 'Q12226954'},
            'قرى_عزلة_مالك'  : {'id': 'Q12226951'},
            'قرى_عزلة_لبعوس'  : {'id': 'Q12226949'},
            'قرى_عزلة_لاعة'  : {'id': 'Q12226948'},
            'قرى_عزلة_كومان'  : {'id': 'Q12226945'},
            'قرى_عزلة_كعيدنة'  : {'id': 'Q12226941'},
            'قرى_عزلة_كرش'  : {'id': 'Q12226939'},
            'قرى_عزلة_كحلان_(حجة)'  : {'id': 'Q12226937'},
            'قرى_عزلة_كحلان'  : {'id': 'Q12226936'},
            'قرى_عزلة_قيفه_ال_مهدي'  : {'id': 'Q12226932'},
            'قرى_عزلة_قيفه_ال_محن_الجوف'  : {'id': 'Q12226929'},
            'قرى_عزلة_قيفه_آل_محن_يزيد'  : {'id': 'Q12226928'},
            'قرى_عزلة_قيدان'  : {'id': 'Q12226927'},
            'قرى_عزلة_قلعة_حميد'  : {'id': 'Q12226922'},
            'قرى_عزلة_قطعة_الصرابي'  : {'id': 'Q12226917'},
            'قرى_عزلة_قطبة'  : {'id': 'Q12226916'},
            'قرى_عزلة_قصل'  : {'id': 'Q12226913'},
            'قرى_عزلة_قصع_حليان'  : {'id': 'Q12226912'},
            'قرى_عزلة_قربة'  : {'id': 'Q12226902'},
            'قرى_عزلة_قدم'  : {'id': 'Q12226901'},
            'قرى_عزلة_قداس'  : {'id': 'Q12226899'},
            'قرى_عزلة_قحزة'  : {'id': 'Q12226897'},
            'قرى_عزلة_قبلة_ابن_عبد_الله'  : {'id': 'Q12226894'},
            'قرى_عزلة_قانية'  : {'id': 'Q12226892'},
            'قرى_عزلة_قارة'  : {'id': 'Q12226888'},
            'قرى_عزلة_فاقع_ال_عوض'  : {'id': 'Q12226885'},
            'قرى_عزلة_فاس'  : {'id': 'Q12226884'},
            'قرى_عزلة_غيل_باوزير'  : {'id': 'Q12226883'},
            'قرى_عزلة_غول_سليمان'  : {'id': 'Q12226880'},
            'قرى_عزلة_غربى_الخميسين'  : {'id': 'Q12226874'},
            'قرى_عزلة_غرب_مستباء'  : {'id': 'Q12226872'},
            'قرى_عزلة_غالب_ربيعي'  : {'id': 'Q12226873'},
            'قرى_عزلة_عينان'  : {'id': 'Q12226870'},
            'قرى_عزلة_عوين'  : {'id': 'Q12226859'},
            'قرى_عزلة_عميد_الداخل'  : {'id': 'Q12226855'},
            'قرى_عزلة_عميد_الخارج'  : {'id': 'Q12226853'},
            'قرى_عزلة_عمقة'  : {'id': 'Q12226852'},
            'قرى_عزلة_علكمة'  : {'id': 'Q12226842'},
            'قرى_عزلة_عقلة_بني_عامر'  : {'id': 'Q12226840'},
            'قرى_عزلة_عفار_آل_مفتاح'  : {'id': 'Q12226839'},
            'قرى_عزلة_عفار'  : {'id': 'Q12226837'},
            'قرى_عزلة_عزمان'  : {'id': 'Q12226832'},
            'قرى_عزلة_عزان'  : {'id': 'Q12226830'},
            'قرى_عزلة_عروان'  : {'id': 'Q12226828'},
            'قرى_عزلة_عردن'  : {'id': 'Q12226825'},
            'قرى_عزلة_عراس'  : {'id': 'Q12226821'},
            'قرى_عزلة_عداعد'  : {'id': 'Q12226816'},
            'قرى_عزلة_عجيب'  : {'id': 'Q12226817'},
            'قرى_عزلة_عبيدة'  : {'id': 'Q12226810'},
            'قرى_عزلة_عبس_(حجة)'  : {'id': 'Q12226808'},
            'قرى_عزلة_عاهم_بني_شهر'  : {'id': 'Q12226805'},
            'قرى_عزلة_عاهم'  : {'id': 'Q12226804'},
            'قرى_عزلة_ظهاى'  : {'id': 'Q12226801'},
            'قرى_عزلة_ظلم'  : {'id': 'Q12226798'},
            'قرى_عزلة_طور_الباحة'  : {'id': 'Q25932274'},
            'قرى_عزلة_ضلاع_الأعلى'  : {'id': 'Q12226788'},
            'قرى_عزلة_ضاعن'  : {'id': 'Q12226787'},
            'قرى_عزلة_ضابي'  : {'id': 'Q20387667'},
            'قرى_عزلة_صيف'  : {'id': 'Q12226783'},
            'قرى_عزلة_صنيد_الشرقي'  : {'id': 'Q12226784'},
            'قرى_عزلة_صنة'  : {'id': 'Q12226780'},
            'قرى_عزلة_صرواح'  : {'id': 'Q12226777'},
            'قرى_عزلة_صبران'  : {'id': 'Q12226774'},
            'قرى_عزلة_صائر'  : {'id': 'Q12226771'},
            'قرى_عزلة_شيزر'  : {'id': 'Q12226770'},
            'قرى_عزلة_شوائط'  : {'id': 'Q12226768'},
            'قرى_عزلة_شمرين'  : {'id': 'Q12226765'},
            'قرى_عزلة_شلف'  : {'id': 'Q12226762'},
            'قرى_عزلة_شقح_وطانف'  : {'id': 'Q12226760'},
            'قرى_عزلة_شعيان'  : {'id': 'Q12226759'},
            'قرى_عزلة_شعب_يافع'  : {'id': 'Q12226755'},
            'قرى_عزلة_شعب_المريسي'  : {'id': 'Q12226754'},
            'قرى_عزلة_شريح'  : {'id': 'Q12226752'},
            'قرى_عزلة_شرقي_الخميسين'  : {'id': 'Q12226745'},
            'قرى_عزلة_شرق_مستباءالاقصى'  : {'id': 'Q12226744'},
            'قرى_عزلة_شرق_مستباء'  : {'id': 'Q12226743'},
            'قرى_عزلة_شرق_السيح'  : {'id': 'Q12226741'},
            'قرى_عزلة_شرف_حاتم'  : {'id': 'Q12226740'},
            'قرى_عزلة_شرس_الاعلى'  : {'id': 'Q12226737'},
            'قرى_عزلة_شرس_الاسفل'  : {'id': 'Q12226739'},
            'قرى_عزلة_شخب'  : {'id': 'Q12226735'},
            'قرى_عزلة_شبام'  : {'id': 'Q12226732'},
            'قرى_عزلة_شباع'  : {'id': 'Q12226730'},
            'قرى_عزلة_سيئون'  : {'id': 'Q12226727'},
            'قرى_عزلة_سير'  : {'id': 'Q12226724'},
            'قرى_عزلة_سودان'  : {'id': 'Q12226721'},
            'قرى_عزلة_سواخ'  : {'id': 'Q12226720'},
            'قرى_عزلة_ساه'  : {'id': 'Q12226707'},
            'قرى_عزلة_زعازع'  : {'id': 'Q12226697'},
            'قرى_عزلة_زريقة_اليمن'  : {'id': 'Q12226698'},
            'قرى_عزلة_زبيد'  : {'id': 'Q12226692'},
            'قرى_عزلة_زارة'  : {'id': 'Q12226688'},
            'قرى_عزلة_ريمة'  : {'id': 'Q12226687'},
            'قرى_عزلة_ريمان'  : {'id': 'Q12226685'},
            'قرى_عزلة_ريده_ورياد'  : {'id': 'Q12226682'},
            'قرى_عزلة_رعين'  : {'id': 'Q12226680'},
            'قرى_عزلة_رعاش'  : {'id': 'Q12226678'},
            'قرى_عزلة_ردمان_ال_عوض'  : {'id': 'Q12226676'},
            'قرى_عزلة_ردمان'  : {'id': 'Q12226677'},
            'قرى_عزلة_رداع'  : {'id': 'Q12226675'},
            'قرى_عزلة_رخية'  : {'id': 'Q12226674'},
            'قرى_عزلة_ربع_ظلمة'  : {'id': 'Q12226665'},
            'قرى_عزلة_ذي_قحم'  : {'id': 'Q12226643'},
            'قرى_عزلة_ذي_شراق'  : {'id': 'Q12226642'},
            'قرى_عزلة_ذي_الحود_ومعاين'  : {'id': 'Q12226638'},
            'قرى_عزلة_ذى_خير'  : {'id': 'Q12226635'},
            'قرى_عزلة_ذو_محمد_وذو_حسين'  : {'id': 'Q12226629'},
            'قرى_عزلة_ذمسنومة'  : {'id': 'Q12226620'},
            'قرى_عزلة_ذاهبة'  : {'id': 'Q12226613'},
            'قرى_عزلة_ذاري_عثمان'  : {'id': 'Q12226611'},
            'قرى_عزلة_دواس'  : {'id': 'Q12226607'},
            'قرى_عزلة_دمقوت'  : {'id': 'Q12226606'},
            'قرى_عزلة_دماج'  : {'id': 'Q12226602'},
            'قرى_عزلة_دلال'  : {'id': 'Q12226600'},
            'قرى_عزلة_دعقين_والحناك'  : {'id': 'Q12226599'},
            'قرى_عزلة_دثران_ال_علوي'  : {'id': 'Q12226596'},
            'قرى_عزلة_داهم'  : {'id': 'Q12226591'},
            'قرى_عزلة_حبيل_جبر'  : {'id': 'Q25932270'},
            'قرى_عزلة_حجراء'  : {'id': 'Q16121074'},
            'قرى_عزلة_خولان'  : {'id': 'Q12226587'},
            'قرى_عزلة_خودان'  : {'id': 'Q12226586'},
            'قرى_عزلة_خنوة'  : {'id': 'Q12226585'},
            'قرى_عزلة_خميس_اليزيدي'  : {'id': 'Q12226578'},
            'قرى_عزلة_خميس_القاضي'  : {'id': 'Q12226575'},
            'قرى_عزلة_خطوه_الحمارين'  : {'id': 'Q12226565'},
            'قرى_عزلة_خباز'  : {'id': 'Q12226556'},
            'قرى_عزلة_حيسان'  : {'id': 'Q12226554'},
            'قرى_عزلة_حوره'  : {'id': 'Q12226550'},
            'قرى_عزلة_حمير'  : {'id': 'Q12226543'},
            'قرى_عزلة_حملان'  : {'id': 'Q12226542'},
            'قرى_عزلة_حماطة'  : {'id': 'Q12226540'},
            'قرى_عزلة_حليمة'  : {'id': 'Q12226539'},
            'قرى_عزلة_حليان'  : {'id': 'Q12226537'},
            'قرى_عزلة_حلاقة_ال_حسين'  : {'id': 'Q12226533'},
            'قرى_عزلة_حقين'  : {'id': 'Q12226531'},
            'قرى_عزلة_حصير_الجار'  : {'id': 'Q12226530'},
            'قرى_عزلة_حزيب'  : {'id': 'Q12226522'},
            'قرى_عزلة_حرض'  : {'id': 'Q12226521'},
            'قرى_عزلة_حرد'  : {'id': 'Q12226519'},
            'قرى_عزلة_حدة'  : {'id': 'Q12226515'},
            'قرى_عزلة_حجر'  : {'id': 'Q12226513'},
            'قرى_عزلة_حبيل_الريدة'  : {'id': 'Q12226511'},
            'قرى_عزلة_حبير'  : {'id': 'Q12226510'},
            'قرى_عزلة_حبروت'  : {'id': 'Q12226509'},
            'قرى_عزلة_حارث_الحيدرى'  : {'id': 'Q12226503'},
            'قرى_عزلة_جياح'  : {'id': 'Q12226501'},
            'قرى_عزلة_جفنة'  : {'id': 'Q12226497'},
            'قرى_عزلة_جرانة'  : {'id': 'Q12226486'},
            'قرى_عزلة_جبلة'  : {'id': 'Q12226482'},
            'قرى_عزلة_جبل_نمر'  : {'id': 'Q12226480'},
            'قرى_عزلة_جبل_معود'  : {'id': 'Q12226478'},
            'قرى_عزلة_جبل_عيان'  : {'id': 'Q12226475'},
            'قرى_عزلة_جبل_عميقة'  : {'id': 'Q12226474'},
            'قرى_عزلة_جبل_عقد'  : {'id': 'Q12226473'},
            'قرى_عزلة_جبل_عصام'  : {'id': 'Q12226472'},
            'قرى_عزلة_جبل_رعوين'  : {'id': 'Q12226469'},
            'قرى_عزلة_جبل_خضراء'  : {'id': 'Q12226467'},
            'قرى_عزلة_جبل_حريم'  : {'id': 'Q12226465'},
            'قرى_عزلة_جبل_حجاج'  : {'id': 'Q12226464'}
        }

#---
  
def main3():
    categ = {}
    #---
    num = 0
    lenth  = len(categories.keys())
    for i in categories.keys():
        num += 1
        ii = re.sub( 'قرى ' , '' , i)
        pywikibot.output( '<<lightyellow>>\n----------\n>>a  %d/%d >> "%s" << <<' % ( num , lenth , ii) )
        pagei = pywikibot.Page(arwiki, ii)
        if pagei:
            MainTitlei = pagei.title(as_link=False)
            itemi = getwditem(MainTitlei)
            #---
            if itemi:
                categ[i] = {'id': itemi.title(as_link=False) }
                pywikibot.output(categ[i])
                
    pywikibot.output(categ)
#---   
def main2():
    options = {}
    #---
    # إضافة التقسيم الإداري
    #---
    #lenth = len(pywikibot.handle_args(args))
    #if lenth == 0:
    #args = {'-ref:قالب:تصنيف_وفيات_في' , '-ns:14'}
    #
    qua = """SELECT ?title WHERE {
            FILTER NOT EXISTS {?item wdt:P131 wd:Q4117509} .
          SERVICE wikibase:mwapi {
             bd:serviceParam wikibase:api "Generator" .
             bd:serviceParam wikibase:endpoint "ar.wikipedia.org" .
             bd:serviceParam mwapi:gcmtitle "تصنيف:categoryYYY" .
             bd:serviceParam mwapi:generator "categorymembers" .
             bd:serviceParam mwapi:gcmprop "ids|title|type" .
             bd:serviceParam mwapi:gcmlimit "max" .
            # out
            ?title wikibase:apiOutput mwapi:title  .
            #?ns wikibase:apiOutput "@ns" .
            ?item wikibase:apiOutputItem mwapi:item .
          }
        }"""
    #---
    for category in categories.keys():
        CategoryID = categories[category]['id']
        quarry = qua
        quarry = re.sub( 'Q4117509' , CategoryID , quarry)
        quarry = re.sub( 'categoryYYY' , category , quarry)
        #pywikibot.output(quarry)
        pagelist = himoBOT.sparql_generator_url(quarry) 
        num = 0
        #---
        for p in pagelist:
            num = num + 1
            page = pywikibot.Page(arwiki, p['title'])
            #text = page.text
            if page:
                MainTitle = page.title(as_link=False)
                #start(text, title)
                #try:   #start(text, title)
                pywikibot.output( '<<lightyellow>>\n----------\n>> %d >> %s << <<' % ( num , MainTitle) )
                item = getwditem(MainTitle)
                #---
                if item:
                    Find_Add_Claims(item , 'P131' , CategoryID , False)
#---   
def main1():
    #---
    # إضافة العزل إلى التصانيف 
    options = {}
    num = 0
    #---
    for category in categories.keys():
        CategoryID = categories[category]['id']
        #pywikibot.output(quarry)
        num += 1
        #---
        pywikibot.output( '<<lightyellow>>\n----------\n>> %d/%d >> %s << <<' % ( num ,len(categories.keys()) ,  category) )
        item = getwditem('تصنيف:' + category)
        #---
        if item:
            Find_Add_Claims(item , 'P971' , CategoryID , 'Q28371991' )
#---
def main():
    if sys.argv and len(sys.argv) > 1:
        if sys.argv[1] == '1':
            main1()
        elif sys.argv[1] == '2':
            main2()
        elif sys.argv[1] == '3':
            main3()
    else:
        pywikibot.output( '<<lightyellow>> no args')
#---
if __name__ == "__main__":
    main()