#!/usr/bin/python
# -*- coding: utf-8 -*-
"""

python pwb.py p131/pp

"""
#
# (C) Ibrahem Qasim, 2022
#	
#
List_pp = {}
#---
List_pp["6940839"] = "Q4117559"		#مديرية صرواح
List_pp["72965"] = "Q335478"		#مدينة مأرب
List_pp["6940594"] = "Q4117504"		#مديرية المغاربة
List_pp["6940618"] = "Q4117593"		#مديرية الحشوة
List_pp["6940797"] = "Q4117492"		#مديرية الصفراء
List_pp["6940827"] = "Q4117512"		#مديرية ردفان 
List_pp["6940845"] = "Q4117248"		#مديرية المحويت
List_pp["70135"] = "Q4812416"		#مديرية الطويلة

#---

List_pp["6940761"] = "Q4117646"
