#!/usr/bin/python
# -*- coding: utf-8 -*-
"""

 
"""
#
# (C) Ibrahem Qasim, 2022
#
#

arabic  = {
        'Q209924' : {'ar' : 'الإسفنجيات الجيرية' , 'en':'calcareous sponge' }
        , 'Q1011212' : {'ar' : 'الجنتوانية' , 'en':'gnetopsida' }
        , 'Q10431061' : {'ar' : 'الأروميانية',"en": "blastocladiomycetes" },
        , 'Q1051432' : {'ar' : 'الميثاناوات الجرثومية' , 'en':'methanomicrobia' }
        , 'Q1054206' : {'ar' : 'الملحاوات العصوية' , 'en':'halobacteria' }
        , 'Q10584811' : {'ar' : 'البويغيات المكروية' , 'en':'microsporea' }
        , 'Q10596701' : {'ar' : 'السويطيانية' , 'en':'' }
        , 'Q1069627' : {'ar' : 'السكيرانية' , 'en':'saccharomycetes' }
        , 'Q8316' : {'ar' : 'ثنائيات الفلقة' ,"en": "Dicotyledones" },
        , 'Q83483' : {'ar' : 'القنفذ البحري' ,"en": "sea urchin" },
        , 'Q839350' : {'ar' : 'السرجيات' ,"en": "Clitellata" },
        , 'Q843232' : {'ar' : 'فنجانيانيات' ,"en": "Pezizomycetes" },
        , 'Q851400' : {'ar' : 'السيستويديات' ,"en": "Cystoids" },
        , 'Q865046' : {'ar' : 'الفصيات',"en": "Lobosea" },
        , 'Q867927' : {'ar' : 'الميثاناوات النارية' ,"en": "Methanopyri" },
        , 'Q943568' : {'ar' : 'العتيقاوات الكروية' ,"en": "Archaeoglobi" },
        , 'Q5113' : {'ar' : 'الطيور',"en": "birds" },
        ,'Q10811':{'ar':'الزواحف'}
        ,'Q10908':{'ar':'البرمائيات'}
        ,'Q1096274':{'ar':'الحزازيات الإسويطية'}
        ,'Q1135978':{'ar':'المستحراوات المكورة'}
        ,'Q1137709':{'ar':'أصيصيانية'}
        ,'Q1149748':{'ar':'حزازيات ذئبية'}
        ,'Q1151744':{'ar':'الطحالب المترابطة'}
        ,'Q11937877':{'ar':'القشريات المتعددة'}
        ,'Q1208690':{'ar':'الطحالب الكارية'}
        ,'Q12207651':{'ar':'الحزازيات القرناء'}
        ,'Q12673556':{'ar':'البكتيريا الملتوية'}
        ,'Q127282':{'ar':'شعاعيات الزعانف'}
        ,'Q127470':{'ar':'خيار البحر'}
        ,'Q128257':{'ar':'رأسيات القدم'}
        ,'Q12967693':{'ar':'السراخس الماراتية'}
        ,'Q131630':{'ar':'ذوات منشأ الحركة'}
        ,'Q131796':{'ar':'الرخصيات'}
        ,'Q132006':{'ar':'شقرانانية'}
        ,'Q132016':{'ar':'الأشنيات الأولفانية'}
        ,'Q132159':{'ar':'الدرينانية'}
        ,'Q132180':{'ar':'العوفنيات'}
        ,'Q132609':{'ar':'الأشنيات الخضراء'}
        ,'Q132649':{'ar':'رأسيات الدرقة'}
        ,'Q132662':{'ar':'فكيات الأرجل'}
        ,'Q132763':{'ar':'السوادانية'}
        ,'Q132809':{'ar':'المطثيات'}
        ,'Q1329304':{'ar':'الصنوبرانيات'}
        ,'Q133551':{'ar':'الملاسانيات'}
        ,'Q133571':{'ar':'اللقنورانية'}
        ,'Q133607':{'ar':'السوردارانية'}
        ,'Q13389544':{'ar':'الكببيانية'}
        ,'Q134668':{'ar':'متقلبات غاما'}
        ,'Q134677':{'ar':'السراخس الكنباثية'}
        ,'Q1349847':{'ar':'السحناوات'}
        ,'Q135200':{'ar':'المخندقانيات'}
        ,'Q1358':{'ar':'العنكبيات'}
        ,'Q136674':{'ar':'متقلبات بيتا'}
        ,'Q136797':{'ar':'متقلبات إيبسيلونية'}
        ,'Q136846':{'ar':'الزملولانية'}
        ,'Q138088':{'ar':'حلميات الأسنان'}
        ,'Q1390':{'ar':'الحشرات'}
        ,'Q1422487':{'ar':'حزازيات سبخية'}
        ,'Q146300':{'ar':'الأنبوبيات'}
        ,'Q147868':{'ar':'المرشانتاناوت'}
        ,'Q149128':{'ar':'العصيات'}
        ,'Q15129663':{'ar':'الأعراف القرصية'}
        ,'Q15129670':{'ar':'العرفيات القرصية'}
        ,'Q152':{'ar':'الأسماك'}
        ,'Q1566901':{'ar':'البلاستويديات'}
        ,'Q159715':{'ar':'الديدان الشريطية'}
        ,'Q160830':{'ar':'لحميات الزعانف'}
        ,'Q162678':{'ar':'الدياتوم'}
        ,'Q167367':{'ar':'ألفية الأرجل'}
        ,'Q17156':{'ar':'اللافصيميات'}
        ,'Q17157':{'ar':'السيسيرنينتيات'}
        ,'Q1763065':{'ar':'الطحالب الذهبية'}
        ,'Q181989':{'ar':'الأبابيات'}
        ,'Q182978':{'ar':'لينات الدرقة'}
        ,'Q184573':{'ar':'الطحالب البنية'}
        ,'Q188360':{'ar':'غلصميات الأرجل'}
        ,'Q188549':{'ar':'الجلكانيات'}
        ,'Q188906':{'ar':'عديدة الأصداف'}
        ,'Q189069':{'ar':'مندمجات الأقواس'}
        ,'Q18952':{'ar':'كثيرات الأشعار'}
        ,'Q190090':{'ar':'الكيسيات'}
        ,'Q190701':{'ar':'قافزات الذيل'}
        ,'Q19106':{'ar':'عناكب البحر'}
        ,'Q193006':{'ar':'قليلات الأشواك'}
        ,'Q194257':{'ar':'صفيحيات الخياشيم الغضروفية'}
        ,'Q19430':{'ar':'سيفيات الذيل'}
        ,'Q19436':{'ar':'عريضات الأجنحة'}
        ,'Q1953103':{'ar':'المستحراوات المتقلبة'}
        ,'Q19962619':{'ar':'الزرقاويات'}
        ,'Q20388475':{'ar':'البفلوفيانية'}
        ,'Q20635347':{'ar':'الملتوياوات'}
        ,'Q207547':{'ar':'المثقوبات'}
        ,'Q21025810':{'ar':'الأشنيات الخضراء المتشجرة'}
        ,'Q212798':{'ar':'المهتزات'}
        ,'Q21447558':{'ar':'البويغيات المتشنكوفيلية'}
        ,'Q221563':{'ar':'ثنائيات الذنب'}
        ,'Q223597':{'ar':'الطلائعيات البيضية'}
        ,'Q22933896':{'ar':'الميدوزات الفنجانية'}
        ,'Q238314':{'ar':'الأصداف النابية'}
        ,'Q240433':{'ar':'السوطيات'}
        ,'Q244147':{'ar':'المؤتلفات'}
        ,'Q25349':{'ar':'نجوم البحر'}
        ,'Q25368':{'ar':'ذوات الصدفتين'}
        ,'Q25371':{'ar':'الأسماك الغضروفية'}
        ,'Q2563582':{'ar':'المتكيسات الرئوية'}
        ,'Q271631':{'ar':'أوليات الذنب'}
        ,'Q272388':{'ar':'الفنجانيات'}
        ,'Q273179':{'ar':'المكعبيات'}
        ,'Q275657':{'ar':'مخاطيات الأبواغ'}
        ,'Q276412':{'ar':'الصدفيات'}
        ,'Q27720':{'ar':'الغاريقونانية'}
        ,'Q28524':{'ar':'الزهريات الشعاعية'}
        ,'Q28805588':{'ar':'العفنانيات'}
        ,'Q28960':{'ar':'اليرقانيات'}
        ,'Q306579':{'ar':'متقلبات ألفا'}
        ,'Q307535':{'ar':'متقلبات دلتا'}
        ,'Q3178797':{'ar':'المخروطانيات'}
        ,'Q332403':{'ar':'الجرابتوليت'}
        ,'Q3329480':{'ar':'متقلبات زيتا'}
        ,'Q3452046':{'ar':'الجبائل'}
        ,'Q3730841':{'ar':'العصوانيات'}
        ,'Q373615':{'ar':'السراخس الرقيقة المباغ'}
        ,'Q425920':{'ar':'الطفيليات الدموية الحيوانية'}
        ,'Q43447':{'ar':'أم أربعة وأربعين'}
        ,'Q4867740':{'ar':'بطنيات القدم'}
        ,'Q488032':{'ar':'مخفيات النبت'}
        ,'Q490800':{'ar':'متشعبات الأرجل'}
        ,'Q510333':{'ar':'البيركولوزوا'}
        ,'Q5605610':{'ar':'السيكادانية'}
        ,'Q586245':{'ar':'مخروطيات الأسنان'}
        ,'Q589697':{'ar':'دودة البلوط'}
        ,'Q6074541':{'ar':'الفطريات الطحلبية'}
        ,'Q610887':{'ar':'الثاليات'}
        ,'Q623286':{'ar':'داخليات الفك'}
        ,'Q642852':{'ar':'حزازيات يشعورية'}
        ,'Q648056':{'ar':'الفطريات الناقصة'}
        ,'Q7377':{'ar':'الثدييات'}
        ,'Q74083':{'ar':'الأسماك المدرعة'}
        ,'Q811147':{'ar':'الكرات النافحة'}
        ,'Q831482':{'ar':'حزازيات حقيقية'}
        ,'Q209924':{'ar':'الإسفنجيات الجيرية'}
    }
                   

o = {}
