#!/usr/bin/python
# -*- coding: utf-8  -*-
#
"""

"""
#
# (C) Ibrahem Qasim, 2022
#
#
import taxoo

arabic  = {
    'Q209924' : {'ar' : 'من الإسفنجيات الجيرية' }
    , 'Q181989' : {'ar' : 'من الأبابيات' }
    , 'Q10431061' : {'ar' : 'من الأروميانية' }
    , 'Q152' : {'ar' : 'من الأسماك' }
    , 'Q25371' : {'ar' : 'من الأسماك الغضروفية' }
    , 'Q74083' : {'ar' : 'من الأسماك المدرعة' }
    , 'Q132016' : {'ar' : 'من الأشنيات الأولفانية' }
    , 'Q132609' : {'ar' : 'من الأشنيات الخضراء' }
    , 'Q21025810' : {'ar' : 'من الأشنيات الخضراء المتشجرة' }
    , 'Q238314' : {'ar' : 'من الأصداف النابية' }
    , 'Q15129663' : {'ar' : 'من الأعراف القرصية' }
    , 'Q146300' : {'ar' : 'من الأنبوبيات' }
    , 'Q10908' : {'ar' : 'من البرمائيات' }
    , 'Q20388475' : {'ar' : 'من البفلوفيانية' }
    , 'Q12673556' : {'ar' : 'من البكتيريا الملتوية' }
    , 'Q1566901' : {'ar' : 'من البلاستويديات' }
    , 'Q21447558' : {'ar' : 'من البويغيات المتشنكوفيلية' }
    , 'Q10584811' : {'ar' : 'من البويغيات المكروية' }
    , 'Q510333' : {'ar' : 'من البيركولوزوا' }
    , 'Q610887' : {'ar' : 'من الثاليات' }
    , 'Q7377' : {'ar' : 'من الثدييات' }
    , 'Q3452046' : {'ar' : 'من الجبائل' }
    , 'Q332403' : {'ar' : 'من الجرابتوليت' }
    , 'Q188549' : {'ar' : 'من الجلكانيات' }
    , 'Q1011212' : {'ar' : 'من الجنتوانية' }
    , 'Q1390' : {'ar' : 'من الحشرات' }
    , 'Q132159' : {'ar' : 'من الدرينانية' }
    , 'Q162678' : {'ar' : 'من الدياتوم' }
    , 'Q159715' : {'ar' : 'من الديدان الشريطية' }
    , 'Q131796' : {'ar' : 'من الرخصيات' }
    , 'Q19962619' : {'ar' : 'من الزرقاويات' }
    , 'Q136846' : {'ar' : 'من الزملولانية' }
    , 'Q28524' : {'ar' : 'من الزهريات الشعاعية' }
    , 'Q10811' : {'ar' : 'من الزواحف' }
    , 'Q1349847' : {'ar' : 'من السحناوات' }
    , 'Q373615' : {'ar' : 'من السراخس الرقيقة المباغ' }
    , 'Q134677' : {'ar' : 'من السراخس الكنباثية' }
    , 'Q12967693' : {'ar' : 'من السراخس الماراتية' }
    , 'Q839350' : {'ar' : 'من السرجيات' }
    , 'Q1069627' : {'ar' : 'من السكيرانية' }
    , 'Q132763' : {'ar' : 'من السوادانية' }
    , 'Q133607' : {'ar' : 'من السوردارانية' }
    , 'Q240433' : {'ar' : 'من السوطيات' }
    , 'Q10596701' : {'ar' : 'من السويطيانية' }
    , 'Q851400' : {'ar' : 'من السيستويديات' }
    , 'Q17157' : {'ar' : 'من السيسيرنينتيات' }
    , 'Q5605610' : {'ar' : 'من السيكادانية' }
    , 'Q276412' : {'ar' : 'من الصدفيات' }
    , 'Q1329304' : {'ar' : 'من الصنوبرانيات' }
    , 'Q184573' : {'ar' : 'من الطحالب البنية' }
    , 'Q1763065' : {'ar' : 'من الطحالب الذهبية' }
    , 'Q1208690' : {'ar' : 'من الطحالب الكارية' }
    , 'Q1151744' : {'ar' : 'من الطحالب المترابطة' }
    , 'Q425920' : {'ar' : 'من الطفيليات الدموية الحيوانية' }
    , 'Q223597' : {'ar' : 'من الطلائعيات البيضية' }
    , 'Q5113' : {'ar' : 'من الطيور' }
    , 'Q943568' : {'ar' : 'من العتيقاوات الكروية' }
    , 'Q15129670' : {'ar' : 'من العرفيات القرصية' }
    , 'Q3730841' : {'ar' : 'من العصوانيات' }
    , 'Q149128' : {'ar' : 'من العصيات' }
    , 'Q28805588' : {'ar' : 'من العفنانيات' }
    , 'Q1358' : {'ar' : 'من العنكبيات' }
    , 'Q132180' : {'ar' : 'من العوفنيات' }
    , 'Q27720' : {'ar' : 'من الغاريقونانية' }
    , 'Q865046' : {'ar' : 'من الفصيات' }
    , 'Q6074541' : {'ar' : 'من الفطريات الطحلبية' }
    , 'Q648056' : {'ar' : 'من الفطريات الناقصة' }
    , 'Q272388' : {'ar' : 'من الفنجانيات' }
    }    
if __name__ == "__main__":
    taxoo.main(arabic)